Autodesk.Revit.DB.CustomFieldData.GetApplicableCategories
Gets the category ids for which this field can be added to the schedule.
Returns:
Returns the category ids for which this field can be added to the schedule.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.GetSpecTypeId
Gets the spec describing the data type.
Returns:
Returns the spec describing the data type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There should be added an instance of ICustomFieldServer with the stored server id.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.IsCustomFieldServerValid
Identifies if there is added to the CustomFieldService an instance of Autodesk.Revit.DB.ICustomFieldServer with the stored server id.
Returns:
Returns true if there is added a Autodesk.Revit.DB.ICustomFieldServer with the stored server id, false otherwise.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.ValidateCustomFieldProperties(Autodesk.Revit.DB.ICustomFieldProperties)
Validates the custom field properties.
customFieldProperties:
An instance of Autodesk.Revit.DB.ICustomFieldProperties which represents the properties of this field.
Returns:
If the properties are valid, an empty string will be returned.
If the properties are not valid, a non-empty string which describes the error will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can't validate the properties of a CustomFieldData of a SchedulableField (which is not added to a schedule).
Since:
2024

Autodesk.Revit.DB.CustomFieldData.SetCustomFieldProperties(Autodesk.Revit.DB.ICustomFieldProperties)
Sets an instance of Autodesk.Revit.DB.ICustomFieldProperties which represents the properties of this field.
customFieldProperties:
An instance of Autodesk.Revit.DB.ICustomFieldProperties which represents the properties of this field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input properties are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can't set the properties to a CustomFieldData of a SchedulableField (which is not added to a schedule).
Since:
2024

Autodesk.Revit.DB.CustomFieldData.GetCustomFieldProperties
Gets an instance of Autodesk.Revit.DB.ICustomFieldProperties which represents the properties of this field.
Returns:
Returns an instance of Autodesk.Revit.DB.ICustomFieldProperties.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can't obtain the properties from a CustomFieldData of a SchedulableField (which is not added to a schedule).
Since:
2024

Autodesk.Revit.DB.CustomFieldData.GetCustomFieldId
Gets an unique identifier of the custom field.
Returns:
Returns an unique identifier of type of custom field.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CustomFieldData.DefaultRowHeightOnSheet
Identifies the default row height for this field.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.FieldName
The name of this custom field.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.FieldTooltip
The tooltip that will be shown in the schedule properties dialog for this custom field.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.DefaultVerticalAlignmentStyle
Identifies the default vertical alignment style.
The default alignment styles are used only if Autodesk.Revit.DB.CustomFieldData.HasCustomGraphicRepresentationOnSheet is true.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.DefaultHorizontalAlignmentStyle
Identifies the default horizontal alignment style.
The default alignment styles are used only if Autodesk.Revit.DB.CustomFieldData.HasCustomGraphicRepresentationOnSheet is true.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.HasCustomGraphicRepresentationOnSheet
Identifies if the field has a custom representation when we have a schedule instance placed on the sheet or if its value will be shown as text.
Since:
2024

Autodesk.Revit.DB.CustomFieldData.StorageType
Identifies the storage type.
Since:
2024

Autodesk.Revit.DB.CustomFieldData
A class that offer access to the information about a custom field.
Since:
2024